ab-tests/rfc2616.pdf/ab_multiprocessing_secure_c10.txt
C:\xampp\apache\bin>abs -n 1000 -c 10 -s 86400 https://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
SSL handshake failed (5).
Completed 800 requests
SSL handshake failed (5).
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      10
Time taken for tests:   431.583 seconds
Complete requests:      1000
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Total transferred:      549606584 bytes
HTML transferred:       549460876 bytes
Requests per second:    2.32 [#/sec] (mean)
Time per request:       4315.826 [ms] (mean)
Time per request:       431.583 [ms] (mean, across all concurrent requests)
Transfer rate:          1243.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 2397 5636.8   1108   66506
Processing:    15 1806 5906.7   1406  132194
Waiting:        4 1486 1011.7   1332    4714
Total:         24 4202 8274.8   2650  132194

Percentage of the requests served within a certain time (ms)
  50%   2650
  66%   3805
  75%   4481
  80%   5172
  90%   7519
  95%  10946
  98%  20066
  99%  35596
 100%  132194 (longest request)