ab-tests/rfc2616.pdf/ab_multithreading_c10.txt
C:\xampp\apache\bin>ab -n 1000 -c 10 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      10
Time taken for tests:   133.147 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      550708000 bytes
HTML transferred:       550562000 bytes
Requests per second:    7.51 [#/sec] (mean)
Time per request:       1331.466 [ms] (mean)
Time per request:       133.147 [ms] (mean, across all concurrent requests)
Transfer rate:          4039.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:    14 1314 1143.4   1123   17243
Waiting:        5 1275 1127.0   1086   17190
Total:         14 1315 1143.5   1124   17244

Percentage of the requests served within a certain time (ms)
  50%   1124
  66%   1562
  75%   1889
  80%   2064
  90%   2527
  95%   3032
  98%   3735
  99%   4782
 100%  17244 (longest request)