ab-tests/rfc2616.pdf/ab_multithreading_c50.txt
C:\xampp\apache\bin>ab -n 1000 -c 50 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      50
Time taken for tests:   389.789 seconds
Complete requests:      1000
Failed requests:        60
   (Connect: 0, Receive: 0, Length: 60, Exceptions: 0)
Total transferred:      517665520 bytes
HTML transferred:       517528280 bytes
Requests per second:    2.57 [#/sec] (mean)
Time per request:       19489.435 [ms] (mean)
Time per request:       389.789 [ms] (mean, across all concurrent requests)
Transfer rate:          1296.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       3
Processing:   714 16768 31362.8   5830  225279
Waiting:        0 8796 12012.6   5123   72906
Total:        714 16768 31362.8   5831  225280

Percentage of the requests served within a certain time (ms)
  50%   5831
  66%   7754
  75%  10586
  80%  12273
  90%  36411
  95%  129596
  98%  133107
  99%  133522
 100%  225280 (longest request)